{
  "children": [
    {
      "title": "The Lion and the Mouse",
      "content": "Once upon a time, a lion spared the life of a mouse. Later, when the lion was trapped in a net, the mouse came to his rescue by chewing through the ropes...",
      "author": "Aesop",
      "image": "Images/Children/book1.png"
    },
    {
      "title": "The Little Red Hen",
      "content": "The Little Red Hen found a grain of wheat and asked her friends for help to plant it. No one helped, so she did everything by herself...",
      "author": "Anonymous",
      "image": "Images/Children/book2.png"
    },
    {
      "title": "Cinderella",
      "content": "A young woman named Cinderella was mistreated by her stepmother and stepsisters. With the help of her fairy godmother, she went to the royal ball and caught the eye of the prince...",
      "author": "Charles Perrault",
      "image": "Images/Children/book3.png"
    },
    {
      "title": "Goldilocks and the Three Bears",
      "content": "Goldilocks stumbles upon a house in the forest belonging to three bears. She tries their porridge, chairs, and beds, only to be caught by the bears...",
      "author": "Robert Southey",
      "image": "Images/Children/book4.png"
    },
    {
      "title": "The Ugly Duckling",
      "content": "A duckling, rejected by others because of his looks, grows up to become a beautiful swan, showing that inner beauty is what truly matters...",
      "author": "Hans Christian Andersen",
      "image": "Images/Children/book5.png"
    },
    {
      "title": "The Velveteen Rabbit",
      "content": "A stuffed rabbit desires to become real, and with the love of a child, he transforms into a living, breathing rabbit...",
      "author": "Margery Williams",
      "image": "Images/Children/book6.png"
    }
  ],
  "fictional": [
    {
      "title": "The Great Gatsby",
      "content": "Nick Carraway narrates the tragic story of Jay Gatsby, a mysterious millionaire who tries to rekindle a past love with Daisy Buchanan...",
      "author": "F. Scott Fitzgerald",
      "image": "Images/Fictional/book1.png"
    },
    {
      "title": "1984",
      "content": "Winston Smith lives under a totalitarian regime that monitors every aspect of his life. He dares to challenge Big Brother, the symbol of the government...",
      "author": "George Orwell",
      "image": "Images/Fictional/book2.png"
    },
    {
      "title": "To Kill a Mockingbird",
      "content": "Scout Finch grows up in the racially segregated American South and witnesses her father, Atticus Finch, defend an innocent black man accused of rape...",
      "author": "Harper Lee",
      "image": "Images/Fictional/book3.png"
    },
    {
      "title": "The Catcher in the Rye",
      "content": "Holden Caulfield recounts his life after being expelled from an elite prep school, struggling with alienation and finding his place in the world...",
      "author": "J.D. Salinger",
      "image": "Images/Fictional/book4.png"
    },
    {
      "title": "Pride and Prejudice",
      "content": "Elizabeth Bennet navigates relationships with her family, the aloof Mr. Darcy, and a series of romantic misunderstandings, leading to her eventual happiness...",
      "author": "Jane Austen",
      "image": "Images/Fictional/book5.png"
    },
    {
      "title": "The Hobbit",
      "content": "Bilbo Baggins, a hobbit, embarks on an unexpected adventure with a group of dwarves to reclaim their homeland from the dragon Smaug...",
      "author": "J.R.R. Tolkien",
      "image": "Images/Fictional/book6.png"
    }
  ],
  "horror": [
    {
      "title": "Dracula",
      "content": "The tale of Count Dracula's attempt to move from Transylvania to England so he can spread the undead curse. Jonathan Harker and others try to stop him...",
      "author": "Bram Stoker",
      "image": "Images/Horror/book1.png"
    },
    {
      "title": "Frankenstein",
      "content": "Victor Frankenstein creates a monster out of body parts, but the creature, rejected by society, becomes vengeful, leading to a tragic downfall...",
      "author": "Mary Shelley",
      "image": "Images/Horror/book2.png"
    },
    {
      "title": "The Shining",
      "content": "Jack Torrance, with his family, becomes the winter caretaker of the Overlook Hotel, where he gradually succumbs to the hotel's sinister influence...",
      "author": "Stephen King",
      "image": "Images/Horror/book3.png"
    },
    {
      "title": "Psycho",
      "content": "Norman Bates, who runs a motel with his domineering mother, spirals into madness, leading to shocking and horrific events...",
      "author": "Robert Bloch",
      "image": "Images/Horror/book4.png"
    },
    {
      "title": "The Haunting of Hill House",
      "content": "A group of people with different backgrounds are brought together to stay in the ominous Hill House, where strange events unfold...",
      "author": "Shirley Jackson",
      "image": "Images/Horror/book5.png"
    },
    {
      "title": "The Exorcist",
      "content": "A young girl named Regan is possessed by a demon, and a priest must perform an exorcism to save her, facing terrifying and supernatural forces...",
      "author": "William Peter Blatty",
      "image": "Images/Horror/book6.png"
    }
  ],
  "categories": {
    "children": {
      "name": "Children",
      "image": "Images/Categories/category1.png"
    },
    "fictional": {
      "name": "Fictional",
      "image": "Images/Categories/category2.png"
    },
    "horror": {
      "name": "Horror",
      "image": "Images/Categories/category3.png"
    }
  }
}
